[
  {
    "name": "Raj",
    "text": "I would like to thank Dr Prem's entire team for the great service. I went to  Apollo Dental OMR based on online reviews where I met Dr Prem Alex Lawrence for implant & ortho consultation. He was answering my queries with patience and  explained everything to me step by step. I was treated with 100% care like a family member. Treatment was awesome with no pain and fear. I highly recommend Prem sir for All-On-4 implant treatment. For ortho, Dr.Janani initially started my braces treatment without any delay and  Dr.Sakthivel took care of my monthly appointment and instructed me exactly what needs to be done. Whenever I approached the doubts they spent enough time to explain and made me feel very comfortable. Big thanks to both of you. You made my smile more beautiful with the confidence to face the world. Member staff made sure to follow up the day after every treatment .The clinic is very well sanitized and well maintained with covid protocols. Thank you so much Dr. Prem and team for your valuable service even during the pandemic when everyone had difficult times. It showed the level of care you have for your patients!"
  },
  {
    "name": "Bala",
    "text": "I happened to be referred to Apollo Dental OMR for my dental treatment by my close friends and well wishers. My first  interaction was with Dr Janani who was very calm and friendly. Initially I was hesitant to undergo sedation but after discussing with Dr Prem and team I was reassured about its positives. They have an experienced anesthetist for sedation who monitored the procedure throughout. Dr Prem is very friendly and sincere. He is one of the best implantologist in chennai. Dr Prem Alex is specialist in All-On-4 and All-On-6 implantation. Overall, my experience was very good with Apollo Dental OMR. I will suggest this clinic to all my friends for any kind of dental issues."
  },
  {
    "name": "Anu",
    "text": "My recent experience with Dr Prem at Apollo Dental OMR was wonderful. I went to the clinic based on the reviews online but wasn't sure until I got my broken braces fixed. I got an early and immediate appointment, there were very reasonable fee charges. The staff were very friendly and caring professionals. Good follow up calls after the treatment it showed they care even after the treatment. Very grateful that I  found them and would personally recommend them."
  },
  {
    "name": "Moganambal",
    "text": "My experience at Apollo Dental OMR has been excellent. I am 50 years old with diabetes and my case was unique and challenging. However the doctors and nurses showed their professionalism when it came to my treatment and I am very satisfied with the All-On-6 implants. All the staff here were very kind and caring to me. Dr. Prem Alex Lawrence was very skilled and handled my case very well."
  },
  {
    "name": "Nagalatha",
    "text": "I was looking to finalize a good Dentist for my implantation,  through one of my friends' references I met  Dr. Prem Alex from Apollo Dental OMR. I was so blessed to have met this doctor. His treatment  for All-On-4 implantation was well planned and very comfortable. The assistant doctors and support staff are very humble courteous and professional in their work"
  },
  {
    "name": "Saravanan",
    "text": "I had been to Dr Prem recently for a routine oral checkup for my family. The doctor and staff were very kind and helpful, they explained each process and clarified all the doubts we had. They identified the decay in my wisdom tooth and advised for extraction of the same. The entire process was smooth and painless. My children and wife were also happy with the treatment and the suggestions provided. I would confidently go to Dr Prem for any future treatments and recommend them to friends and family."
  },
  {
    "name": "Pranavi",
    "text": "I have been going to Dr Prem for almost a year now. The doctor and the staff have been very friendly and they make sure to give a follow up call the next day after the procedure. The doctor clearly and patiently explains the detailed procedure before, during and after the treatment, and keeps us informed about the next review date. If in case of an emergency, the staff make sure to give the latest appointment. Overall, a very satisfying experience. "
  },
  {
    "name": "Annette",
    "text": "I had a good experience at Dr Prem. All the doctors I interacted with are very friendly and make you at ease even if you are an anxious patient. They explained the procedures clearly and patiently before performing them. The clinic is well maintained and clean. Would definitely recommend this clinic."
  },
  {
    "name": "Padma",
    "text": "Excellent service for patients. They take really good care of senior citizens. The doctors are kind and experienced and answer your queries and ensure that you are ready. Dr Rekha attended my case and she did an exceptional job. I highly recommend this place."
  },
  {
    "name": "Shanmugapriya",
    "text": "My close friend recommended Apollo Dental OMR, which was far from my location. However, I approached them and booked my first appointment with Dr.Janani. She assisted me and was professional, kind and soft spoken. Dr.Prem explained about different types of braces and its benefits which helped me be very well informed. Although this place had a distance of 15km from my place, I still chose them because I had a great response after my appointment. Dr.Janani initially started my braces treatment without any delay amidst covid were impressive and remarkable. Maintaining all precautionary methods and ensuring that I am comfortable. Dr. Sakthivel took care of my monthly appointment and instructed me exactly what needs to be done. I have followed the same and the results were exemplary and am literally excited. Dr.Rekha did my upper extraction and Dr.Vijayaraghavan did my lower extraction both were amazing. My experience and results were outstanding. I would recommend this place for sure."
  }
]